Documents/ПутевойЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ПутевойЛист</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПокупателями</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоОплатеТруда</xr:Item>
				<xr:Item>AccumulationRegister.ФинансовыйРезультат</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеДокументыВыданные</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыССотрудниками</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
				<xr:Item>InformationRegister.ПоказанияСпидометра</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Машины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыРазвоза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказанияСпидометра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатыЗаГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаправкаЛитры1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаправкаСтоимость1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗарплатаВодителя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьПоездки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднийРасход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифМаршрута</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатыЗаГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаправкаЛитры2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаправкаСтоимость2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет_СКС_1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасчетныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет_СКС_2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасчетныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗарплатаЭкспедитора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьРасходыПоПоездке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьРасходыНаЗапчасти</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьРасходыНаРемонт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маршруты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутыРазвоза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаправочнаяВедомость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОплатыЗаГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет_СКС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РасчетныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Литры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЧека</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЧека</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаправкаТалоны</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаправкаНоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаправкаЛитрыСмартКарта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаправкаСтоимостьСмартКарта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеРасчитывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПутевойЛист/Ext/ManagerModule.bsl
Функция СформироватьТаблицыДляПроведения(ссылка) Экспорт
	
	запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	    
	// 2 - "ДенежныеДокументыВыданные"
	// 3 - "ПартииТоваровНаСкладах"
	// 4 - "ФинансовыйРезультат"
	// 5 - "ВзаиморасчетыССотрудниками"
	// 6 - "РасчетыПоОплатеТруда"
	// 7 - "ПоказанияСпидометра"
	// 8 - "ВзаиморасчетыСПокупателями"
	
	запрос.Текст = 
	"ВЫБРАТЬ
	|	ПутевойЛистЗаправочнаяВедомость.ЗаправкаТалоны КАК ТалоныКоличество,
	|	ПутевойЛистЗаправочнаяВедомость.ЗаправкаНоменклатура КАК Номенклатура,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * ПутевойЛистЗаправочнаяВедомость.ЗаправкаТалоны КАК ТалоныСумма,
	|	ПутевойЛистЗаправочнаяВедомость.Ссылка.Дата КАК Период,
	|	ПутевойЛистЗаправочнаяВедомость.Ссылка.Водитель КАК Сотрудник,
	|	ПутевойЛистЗаправочнаяВедомость.Ссылка.Подразделение,
	|	ВалютаУчета.Значение КАК Валюта,
	|	ПутевойЛистЗаправочнаяВедомость.ЗаправкаНоменклатура.СчетУчета КАК НоменклатураСчетУчета,
	|	ПутевойЛистЗаправочнаяВедомость.ЗаправкаНоменклатура.Родитель.Склад КАК Склад,
	|	ПутевойЛистЗаправочнаяВедомость.Ссылка.Автомобиль,
	|	ПутевойЛистЗаправочнаяВедомость.Ссылка.ПоказанияСпидометра
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	Документ.ПутевойЛист.ЗаправочнаяВедомость КАК ПутевойЛистЗаправочнаяВедомость
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаСреза, ) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ПутевойЛистЗаправочнаяВедомость.Ссылка.Подразделение = ЦеныНоменклатурыСрезПоследних.Подразделение
	|			И ПутевойЛистЗаправочнаяВедомость.ЗаправкаНоменклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И (ЦеныНоменклатурыСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.Закупка)),
	|	Константа.ВалютаУчета КАК ВалютаУчета
	|ГДЕ
	|	ПутевойЛистЗаправочнаяВедомость.Ссылка = &Ссылка
	|	И ПутевойЛистЗаправочнаяВедомость.ЗаправкаНоменклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПутевойЛист.Дата КАК Период,
	|	ПутевойЛист.Подразделение,
	|	ПутевойЛист.Водитель КАК Сотрудник,
	|	ЗНАЧЕНИЕ(Справочник.ВидыРасчетов.ОплатаПоПробегу) КАК ВидРасчета,
	|	ПутевойЛист.ЗарплатаВодителя КАК Результат
	|ПОМЕСТИТЬ ВТ_Зарплата
	|ИЗ
	|	Документ.ПутевойЛист КАК ПутевойЛист
	|ГДЕ
	|	ПутевойЛист.Ссылка = &Ссылка
	|	И ПутевойЛист.ЗарплатаВодителя <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПутевойЛист.Дата,
	|	ПутевойЛист.Подразделение,
	|	ПутевойЛист.Экспедитор,
	|	ЗНАЧЕНИЕ(Справочник.ВидыРасчетов.ОплатаПоПробегу),
	|	ПутевойЛист.ЗарплатаЭкспедитора
	|ИЗ
	|	Документ.ПутевойЛист КАК ПутевойЛист
	|ГДЕ
	|	ПутевойЛист.Ссылка = &Ссылка
	|	И ПутевойЛист.ЗарплатаЭкспедитора <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПутевойЛистЗарплата.Ссылка.Дата,
	|	ПутевойЛистЗарплата.Ссылка.Подразделение,
	|	ПутевойЛистЗарплата.Сотрудник,
	|	ПутевойЛистЗарплата.ВидРасчета,
	|	ПутевойЛистЗарплата.Результат
	|ИЗ
	|	Документ.ПутевойЛист.Зарплата КАК ПутевойЛистЗарплата
	|ГДЕ
	|	ПутевойЛистЗарплата.Ссылка = &Ссылка
	|	И ПутевойЛистЗарплата.Результат <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДенежныеДокументы.ВидДвижения,
	|	ДенежныеДокументы.Период,
	|	ДенежныеДокументы.Подразделение,
	|	ДенежныеДокументы.Сотрудник,
	|	ДенежныеДокументы.Номенклатура,
	|	ДенежныеДокументы.Количество,
	|	ДенежныеДокументы.Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|		ВТ_ТаблицаДокумента.Период КАК Период,
	|		ВТ_ТаблицаДокумента.Подразделение КАК Подразделение,
	|		ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|		ВТ_ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|		ВТ_ТаблицаДокумента.ТалоныКоличество КАК Количество,
	|		ВТ_ТаблицаДокумента.ТалоныСумма КАК Сумма
	|	ИЗ
	|		ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента) КАК ДенежныеДокументы
	|ГДЕ
	|	ДенежныеДокументы.Количество <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииТоваровНаСкладах.ВидДвижения,
	|	ПартииТоваровНаСкладах.Период,
	|	ПартииТоваровНаСкладах.Подразделение,
	|	ПартииТоваровНаСкладах.Склад,
	|	ПартииТоваровНаСкладах.МОЛ,
	|	ПартииТоваровНаСкладах.Номенклатура,
	|	ПартииТоваровНаСкладах.СчетУчета,
	|	ПартииТоваровНаСкладах.Количество,
	|	ПартииТоваровНаСкладах.Стоимость,
	|	ПартииТоваровНаСкладах.СтоимостьВал,
	|	ПартииТоваровНаСкладах.Валюта,
	|	ПартииТоваровНаСкладах.ВидХранения,
	|	ПартииТоваровНаСкладах.КорСчет
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|		ВТ_ТаблицаДокумента.Период КАК Период,
	|		ВТ_ТаблицаДокумента.Подразделение КАК Подразделение,
	|		ВТ_ТаблицаДокумента.Склад КАК Склад,
	|		ВТ_ТаблицаДокумента.Сотрудник КАК МОЛ,
	|		ВТ_ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|		ВТ_ТаблицаДокумента.НоменклатураСчетУчета КАК СчетУчета,
	|		ВТ_ТаблицаДокумента.ТалоныКоличество КАК Количество,
	|		ВТ_ТаблицаДокумента.ТалоныСумма КАК Стоимость,
	|		ВТ_ТаблицаДокумента.ТалоныСумма КАК СтоимостьВал,
	|		ВТ_ТаблицаДокумента.Валюта КАК Валюта,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыХраненияЗапасов.ВПодотчете) КАК ВидХранения,
	|		ЗНАЧЕНИЕ(ПланСчетов.Внутренний.Затраты) КАК КорСчет
	|	ИЗ
	|		ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента) КАК ПартииТоваровНаСкладах
	|ГДЕ
	|	ПартииТоваровНаСкладах.Количество <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФинансовыйРезультат.Период,
	|	ФинансовыйРезультат.Подразделение,
	|	ФинансовыйРезультат.Объект,
	|	ФинансовыйРезультат.СтатьяЗатрат,
	|	ФинансовыйРезультат.СтатьяДоходов,
	|	СУММА(ФинансовыйРезультат.СуммаРасходов) КАК СуммаРасходов,
	|	ФинансовыйРезультат.СуммаДоходов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ТаблицаДокумента.Период КАК Период,
	|		ВТ_ТаблицаДокумента.Подразделение КАК Подразделение,
	|		ВТ_ТаблицаДокумента.Автомобиль КАК Объект,
	|		ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.РасходыНаГСМ) КАК СтатьяЗатрат,
	|		НЕОПРЕДЕЛЕНО КАК СтатьяДоходов,
	|		ВТ_ТаблицаДокумента.ТалоныСумма КАК СуммаРасходов,
	|		0 КАК СуммаДоходов
	|	ИЗ
	|		ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|	ГДЕ
	|		ВТ_ТаблицаДокумента.ТалоныСумма <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПутевойЛист.Дата,
	|		ПутевойЛист.Подразделение,
	|		ПутевойЛист.Автомобиль,
	|		АТ_СтатьяЗатратПоЗарплате.Значение,
	|		НЕОПРЕДЕЛЕНО,
	|		ПутевойЛист.ЗарплатаВодителя,
	|		0
	|	ИЗ
	|		Документ.ПутевойЛист КАК ПутевойЛист,
	|		Константа.АТ_СтатьяЗатратПоЗарплате КАК АТ_СтатьяЗатратПоЗарплате
	|	ГДЕ
	|		ПутевойЛист.Ссылка = &Ссылка
	|		И ПутевойЛист.ЗарплатаВодителя <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПутевойЛист.Дата,
	|		ПутевойЛист.Подразделение,
	|		ПутевойЛист.Автомобиль,
	|		АТ_СтатьяЗатратПоЗарплате.Значение,
	|		НЕОПРЕДЕЛЕНО,
	|		ПутевойЛист.ЗарплатаЭкспедитора,
	|		0
	|	ИЗ
	|		Документ.ПутевойЛист КАК ПутевойЛист,
	|		Константа.АТ_СтатьяЗатратПоЗарплате КАК АТ_СтатьяЗатратПоЗарплате
	|	ГДЕ
	|		ПутевойЛист.Ссылка = &Ссылка
	|		И ПутевойЛист.ЗарплатаЭкспедитора <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПутевойЛистСписокЗатрат.Ссылка.Дата,
	|		ПутевойЛистСписокЗатрат.Ссылка.Подразделение,
	|		ПутевойЛистСписокЗатрат.Ссылка.Автомобиль,
	|		ПутевойЛистСписокЗатрат.СтатьяЗатрат,
	|		НЕОПРЕДЕЛЕНО,
	|		ПутевойЛистСписокЗатрат.Сумма,
	|		0
	|	ИЗ
	|		Документ.ПутевойЛист.СписокЗатрат КАК ПутевойЛистСписокЗатрат
	|	ГДЕ
	|		ПутевойЛистСписокЗатрат.Ссылка = &Ссылка
	|		И ПутевойЛистСписокЗатрат.Сумма <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПутевойЛистЗарплата.Ссылка.Дата,
	|		ПутевойЛистЗарплата.Ссылка.Подразделение,
	|		ПутевойЛистЗарплата.Ссылка.Автомобиль,
	|		ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.РасходыНаОплатуТруда),
	|		НЕОПРЕДЕЛЕНО,
	|		ПутевойЛистЗарплата.Результат,
	|		0
	|	ИЗ
	|		Документ.ПутевойЛист.Зарплата КАК ПутевойЛистЗарплата
	|	ГДЕ
	|		ПутевойЛистЗарплата.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПутевойЛист.Дата,
	|		ПутевойЛист.Подразделение,
	|		ПутевойЛист.Автомобиль,
	|		НЕОПРЕДЕЛЕНО,
	|		ЗНАЧЕНИЕ(Справочник.СтатьиДоходов.ТранспортныеУслуги),
	|		0,
	|		ПутевойЛист.СуммаДокумента
	|	ИЗ
	|		Документ.ПутевойЛист КАК ПутевойЛист
	|	ГДЕ
	|		ПутевойЛист.Ссылка = &Ссылка
	|		И ПутевойЛист.Плательщик <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ФинансовыйРезультат
	|
	|СГРУППИРОВАТЬ ПО
	|	ФинансовыйРезультат.Период,
	|	ФинансовыйРезультат.Подразделение,
	|	ФинансовыйРезультат.Объект,
	|	ФинансовыйРезультат.СтатьяЗатрат,
	|	ФинансовыйРезультат.СуммаДоходов,
	|	ФинансовыйРезультат.СтатьяДоходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВТ_Зарплата.Период,
	|	ВТ_Зарплата.Подразделение,
	|	ВТ_Зарплата.Сотрудник,
	|	СУММА(ВТ_Зарплата.Результат) КАК Сумма,
	|	ЗНАЧЕНИЕ(ПланСчетов.Внутренний.Зарплата) КАК СчетУчета,
	|	ВалютаУчета.Значение КАК Валюта
	|ИЗ
	|	ВТ_Зарплата КАК ВТ_Зарплата,
	|	Константа.ВалютаУчета КАК ВалютаУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Зарплата.Период,
	|	ВТ_Зарплата.Подразделение,
	|	ВалютаУчета.Значение,
	|	ВТ_Зарплата.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(виддвижениянакопления.расход),
	|	ПутевойЛистСписокЗатрат.Ссылка.Дата,
	|	ПутевойЛистСписокЗатрат.Ссылка.Подразделение,
	|	ПутевойЛистСписокЗатрат.Ссылка.Водитель,
	|	СУММА(ПутевойЛистСписокЗатрат.Сумма),
	|	ЗНАЧЕНИЕ(ПланСчетов.Внутренний.Подотчет),
	|	ВалютаУчета.Значение
	|ИЗ
	|	Документ.ПутевойЛист.СписокЗатрат КАК ПутевойЛистСписокЗатрат,
	|	Константа.ВалютаУчета КАК ВалютаУчета
	|ГДЕ
	|	ПутевойЛистСписокЗатрат.Ссылка = &Ссылка
	|	И ПутевойЛистСписокЗатрат.Сумма <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ПутевойЛистСписокЗатрат.Ссылка.Подразделение,
	|	ВалютаУчета.Значение,
	|	ПутевойЛистСписокЗатрат.Ссылка.Дата,
	|	ПутевойЛистСписокЗатрат.Ссылка.Водитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Зарплата.Период,
	|	ВТ_Зарплата.Подразделение,
	|	НАЧАЛОПЕРИОДА(ВТ_Зарплата.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|	ВТ_Зарплата.Сотрудник,
	|	ВТ_Зарплата.ВидРасчета,
	|	СУММА(ВТ_Зарплата.Результат) КАК Результат
	|ИЗ
	|	ВТ_Зарплата КАК ВТ_Зарплата
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Зарплата.ВидРасчета,
	|	ВТ_Зарплата.Период,
	|	ВТ_Зарплата.Подразделение,
	|	НАЧАЛОПЕРИОДА(ВТ_Зарплата.Период, МЕСЯЦ),
	|	ВТ_Зарплата.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПутевойЛист.Дата КАК Период,
	|	ПутевойЛист.Подразделение,
	|	ПутевойЛист.Автомобиль КАК Машина,
	|	ПутевойЛист.ПоказанияСпидометра КАК Спидометр
	|ИЗ
	|	Документ.ПутевойЛист КАК ПутевойЛист
	|ГДЕ
	|	ПутевойЛист.ПоказанияСпидометра <> 0
	|	И ПутевойЛист.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(виддвижениянакопления.приход) КАК ВидДвижения,
	|	ПутевойЛист.Дата КАК Период,
	|	ПутевойЛист.Подразделение,
	|	ПутевойЛист.Плательщик КАК Контрагент,
	|	ЗНАЧЕНИЕ(справочник.менеджеры.безменеджера) КАК Менеджер,
	|	ПутевойЛист.СуммаДокумента КАК Сумма,
	|	ВалютаУчета.Значение КАК Валюта
	|ИЗ
	|	Документ.ПутевойЛист КАК ПутевойЛист,
	|	Константа.ВалютаУчета КАК ВалютаУчета
	|ГДЕ
	|	ПутевойЛист.Ссылка = &Ссылка
	|	И ПутевойЛист.Плательщик <> ЗНАЧЕНИЕ(Справочник.Контрагенты.пустаяссылка)";
	
	#КонецОбласти 
	
	запрос.УстановитьПараметр("Ссылка", ссылка);
	запрос.УстановитьПараметр("ДатаСреза", ссылка.Дата);
	
	Возврат запрос.ВыполнитьПакет();
	
КонецФункции
